In [21]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline


data = {'a': [2, 3, 4],
       'b': [5, 6, 7],
       'c': [8, 9, 10]}

data = pd.DataFrame(data, columns=['a', 'b', 'c'])

data

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [22]:
from sqlalchemy import create_engine

In [23]:
# Create your engine

engine = create_engine('sqlite:///:memory:')

In [24]:
data

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [25]:
data.to_sql('data', engine)

In [26]:
with engine.connect() as conn, conn.begin():
    data_1 = pd.read_sql_table('data', conn)

In [27]:
data_1

   index  a  b   c
0      0  2  5   8
1      1  3  6   9
2      2  4  7  10

## COOL snippet of SQLAlchemy

### Sqlite fallback

The use of sqlite is supported without using SQLAlchemy.  This mode requires a Python database adaptor which respect the Python DB-API.

You can create connections like so:

In [15]:
import sqlite3
con = sqlite3.connect(':memory:')

In [16]:
out_sqlite = 'my.sqlite'

In [17]:
cnx = sqlite3.connect(out_sqlite)

In [20]:
data.to_sql('my_data', cnx)
pd.read_sql_query("SELECT * FROM my_data", con)

DatabaseError: Execution failed on sql 'SELECT * FROM my_data': no such table: my_data

In [28]:
books = pd.read_csv('BX-Books.csv', sep=';', error_bad_lines=False,
                   encoding='latin-1')
books.head()

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
/Users/sammylee/miniconda3/envs/DataScience/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [30]:
# We want the dashes in the column names to not be there, so:
books.columns = ['ISBN', 'bookTitle', 'bookAuthor',
                'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']

users = pd.read_csv('BX-Users.csv', sep=';', error_bad_lines=False, encoding='latin-1')
users.columns = ['userID', 'Location', 'Age']

ratings = pd.read_csv('BX-Book-Ratings.csv', sep=';', error_bad_lines=False, encoding='latin-1')
ratings.columns = ['userID', 'ISBN', 'bookRating']

### Ratings data

The ratings dataset provides a list of ratings that users have given to books.  It includes 1,149,780 records and 3 fields: userID, ISBN, and bookRating.

In [ ]:
print